app/Http/Controllers/Admin/PictureController.php

  public function index()
  {
    $pictures = Picture::all();
---
select * from `pictures` where `pictures`.`deleted_at` is null

  public function store(StoreRequest $request)
  {
    dd($request);
    $data = $request->validated();
    Picture::firstOrCreate($data);
---
insert into `pictures` (`url`, `updated_at`, `created_at`) values ('http://127.0.0.1:8000/storage/images/n6S1d2phKsW5iTPwqeRX7Is8kuqJuCcwxW7GQsAn.jpg', '2022-06-15 20:25:11', '2022-06-15 20:25:11')